app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test"], ["article_id", 1], ["created_at", "2016-11-06 12:18:10.278687"], ["updated_at", "2016-11-06 12:18:10.278687"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2016-11-06 12:08:55.817230"], ["id", 1]]
---
    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(params[:comment].permit(:body))
        @comment.user_id = current_user.id if current_user

        if @comment.save